import numpy as np

print("*************创建一维数组********************")
# 类似array()方法中加列表
a1 = np.array([1, 3, 54, 5])
print(a1)

print("*************创建二维数组********************")
# 每一项相当于每一行,行内元素必须相等
a2 = np.array([[1, 3, 4], [8, 5, 4], [5, 2, 4]])
print(a2)

print("*************对数组进行排序********************")
a1.sort()
print('数组a1排序%s:' % a1)
a2.sort()
'''
二维数组,每一行排序
'''
print('数组a2排序%s:' % a2)

print("*************取数组最大最小值********************")

max1 = a1.max()
print(max1)
max2 = a2.max()
min2 = a2.min()
print(min2)
print(max2)

print("*************对数组切片处理********************")
print('a1数组:%s' % a1)
print(a1[1:3])  # a[1] 能取到 ,a[3]取不到, 左闭右开,和列表切片一样,也是左开右闭
print(a1[1])





