'''
https://blog.csdn.net/qq_16014497/article/details/79487971

什么是composer？以及composer是干什么用的？工作原理
php包管理工具,下载管理第三方的包
自动完成下载,include两步,下载下来的包在composer.json文件中

PHP如何实现静态化
即不须要再去执行PHP脚本等server端的语言去执行，我们能够直接訪问到的网页。这就是静态网页
为了站点的推广和seo的需要

你了解设计模式吗？说下你最常用的设计模式
单例模式: 某个类只能有一个实例, 使用单例模式,可以避免大量的new操作消耗的资源
工厂模式: 用一个工厂类来实例化所有的子类
观察者模式 : 观察者模式属于行为模式,是定义在对象间的一种一对多的依赖关系,以便当一个对象状态发生变化时,所有依赖于他的
            对象都得到通知并自动刷新

观察者模式是如何实现的？工厂模式是如何实现的？适配器模式是如何实现的?



PHP的优化方案

说下你了解的session和cookie
如何实现不基于session和cookie的用户认证。


说下你目前框架所用到的核心概念
mvc
什么是CSRF攻击，XSS攻击？如何防范
csrf:

你了解RESTful API吗？说说干什么用的。
设计的原则
如果实现自动加载？不用composer如何实现？PSR-4是什么？












'''