'''
numpy  可以搞效的处理数据,提供数组支持,很多啊模块都依赖它,比如pandas.scipy.matplotlib,所以这是一个基础模块

pandas 我们课程后续用的最多的一个模块,主要用户进行数据探索和数据分析

matplotlib 作图模块,解决可视化问题

scipy 主要进行数值计算,同时支持矩阵运算,并且提供了很多高等数据处理功能,比如微积分.傅里叶变换,微分方程求解

statsmodels 这个模块只要用于统计分析

gensim  这个模块只要用于文本挖掘

sklearn keram   前者机器学习,后者深度学习



'''

'''
numpy数组和python列表虽然可以相互转换,并且有功能相似,但是,在底层效率上,
numpy数组的效率要比列表高,c语言级别的


'''


'''
numpy 需要掌握的知识点:
创建数组(一维和二维)
数组排序
数组取最大最小值
数组切片操作

'''



'''
pandas 知识点:
pandas中衍生出两个类似新数据结构的类型,创建完打印出来会带类似列名和行名的索引,有默认,也可设置
series      一行和一列
dataframe   行和列整合出来的表格(另一种通过字典的方式去创建数据框)





'''







